[{"name":"ESP32-S2","type":"Soc's","description":""},{"name":"ESP32-S2F","type":"Soc's","description":""},{"name":"ESP32-D0WD-V3","type":"Soc's","description":""},{"name":"ESP32-D0WD","type":"Soc's","description":""},{"name":"ESP32-D0WDQ6-V3","type":"Soc's","description":""},{"name":"ESP32-U4WDH","type":"Soc's","description":""},{"name":"ESP32-PICO-V3","type":"Soc's","description":""},{"name":"ESP32-PICO-V3-02","type":"Soc's","description":""},{"name":"ESP32-PICO-D4","type":"Soc's","description":""},{"name":"ESP8266EX","type":"Soc's","description":""},{"name":"ESP32-C3-MINI-1","type":"Module","description":"ESP32-C3-MINI-1 is a general-purpose Wi-Fi and Bluetooth LE module. This module features a rich set of peripherals and a small size, which makes it an ideal choice for smart home, industrial automation, health care, consumer electronics, etc."},{"name":"ESP32-C3-WROOM-1","type":"Module","description":"ESP32-C3-WROOM-1 is a general-purpose Wi-Fi and Bluetooth LE module. This module features a rich set of peripherals and high performance, which makes it an ideal choice for smart home, industrial automation, healthcare, consumer electronics, etc."},{"name":"ESP32-S2-MINI-1","type":"Module","description":"ESP32-S2-MINI-1 is a powerful, generic Wi-Fi MCU modules that have a rich set of peripherals. It's an ideal choice for a wide variety of application scenarios relating to Internet of Things (IoT), wearable electronics and smart home.  At the core of this module is ESP32-S2FH4, an Xtensa® 32-bit LX7 CPU that operates at up to 240 MHz."},{"name":"ESP32-S2-MINI-1U","type":"Module","description":"ESP32-S2-MINI-1U is a powerful, generic Wi-Fi MCU modules that have a rich set of peripherals. It's an ideal choice for a wide variety of application scenarios relating to Internet of Things (IoT), wearable electronics and smart home.  At the core of this module is ESP32-S2FH4, an Xtensa® 32-bit LX7 CPU that operates at up to 240 MHz."},{"name":"ESP32-S2-WROOM","type":"Module","description":"ESP32-S2-WROOM integrates ESP32-S2. It is a powerful, generic Wi-Fi MCU module that has a rich set of peripherals."},{"name":"ESP32-S2-WROOM-I","type":"Module","description":"ESP32-S2-WROOM-I integrates ESP32-S2. It is a powerful, generic Wi-Fi MCU module that has a rich set of peripherals."},{"name":"ESP32-S2-WROVER","type":"Module","description":"ESP32-S2-WROVER integrates ESP32-S2. It is a powerful, generic Wi-Fi MCU module that has a rich set of peripherals."},{"name":"ESP32-S2-WROVER-I","type":"Module","description":"ESP32-S2-WROVER-I integrates ESP32-S2. It is a powerful, generic Wi-Fi MCU module that has a rich set of peripherals."},{"name":"ESP32-WROOM-32E","type":"Module","description":"ESP32-WROOM-32E integrates ESP32-D0WD-V3, with higher stability and safety performance."},{"name":"ESP32-WROOM-32UE","type":"Module","description":"ESP32-WROOM-32UE integrates ESP32-D0WD-V3, with higher stability and safety performance."},{"name":"ESP32-WROOM-32SE","type":"Module","description":"ESP32-WROOM-32SE integrates ESP32-D0WD. ESP32-WROOM-32SE has a built-in ATECC608A chip, which acts as a secure storage for device certificates."},{"name":"ESP32-WROVER-E","type":"Module","description":"ESP32-WROVER-E integrates ESP32-D0WD-V3, with higher stability and safety performance."},{"name":"ESP32-WROVER-IE","type":"Module","description":"ESP32-WROVER-IE integrates ESP32-D0WD-V3, with higher stability and safety performance"},{"name":"ESP32-MINI-1","type":"Module","description":"ESP32-MINI-1 is a highly-integrated, small-sized Wi-Fi+Bluetooth®+Bluetooth® LE MCU module that has a rich set of peripherals. This module is an ideal choice for a wide variety of IoT applications, ranging from home automation, smart building, consumer electronics to industrial control, especially suitable for applications within a compact space, such as bulbs, switches and sockets."},{"name":"ESP32-PICO-V3-ZERO","type":"Module","description":"ESP32-PICO-V3-ZERO is an Alexa Connect Kit (ACK) module with Espressif. It provides an easy way for customers to build Alexa-compatible devices without worrying about managing cloud services, writing an Alexa Skill, creating phone applications or developing complex network and security firmware. ESP32-PICO-V3-ZERO is based on ESP32-PICO-V3, a System-in-Package (SiP) device. It provides complete Wi-Fi and Bluetooth® functionalities with ultra-small size, robust performance and low energy consumption."},{"name":"ESP32-PICO-MINI-02","type":"Module","description":"ESP32-PICO-MINI-02 is a small-sized powerful Wi-Fi+Bluetooth®+Bluetooth® LE MCU module. It is based on ESP32-PICO-V3-02, a System-in-Package (SiP) device, which integrates an 8 MB SPI flash, 2 MB SPI Pseudo static RAM (PSRAM) and 40 MHz oscillator. This module targets a wide variety of IoT applications, ranging from home automation, smart building, consumer electronics to industrial control, and it is suitable for intelligent speakers, speech recognition toys, intelligent gateway and Ethernet, etc."},{"name":"ESP32-SOLO-1","type":"Module","description":"ESP32-SOLO-1 is a powerful, generic Wi-Fi+BT+Bluetooth LE MCU module that targets a wide variety of applications, ranging from low-power sensor networks to the most demanding tasks, such as voice encoding, music streaming and MP3 decoding."},{"name":"ESP32-DU1906","type":"Module","description":"ESP32-DU1906 is an industry-leading AIoT voice module powered by Espressif's flagship chip ESP32-D0WD-V3 and Baidu's HongHu voice chip DU1906. This module integrates Wi-Fi, classic Bluetooth, BLE, and voice processing circuits on board, providing first-class user experience for speech wake-up and interaction."},{"name":"ESP32-WROOM-32D","type":"Module","description":"ESP32-WROOM-32D integrates ESP32-D0WD. It targets a wide variety of applications, ranging from low-power sensor networks to the demanding tasks, such as voice encoding, music streaming and MP3 decoding."},{"name":"ESP32-WROOM-32U","type":"Module","description":"ESP32-WROOM-32U integrates ESP32-D0WD. It integrates a U.FL connector."},{"name":"ESP32-WROOM-32","type":"Module","description":"ESP32-WROOM-32 contains the ESP32 SoC, flash memory, high-precision discrete components, and a PCB antenna which provides outstanding RF performance in space-constrained applications."},{"name":"ESP32-WROVER-B","type":"Module","description":"ESP32-WROVER-B is a powerful, generic WiFi-BT-Bluetooth LE MCU module that targets a wide variety of applications, ranging from low-power sensor networks to the most demanding tasks, such as voice encoding, music streaming and MP3 decoding."},{"name":"ESP32-WROVER-IB","type":"Module","description":"ESP32-WROVER-IB is a powerful, generic Wi-Fi+BT+Bluetooth LE MCU module that targets a wide variety of applications, ranging from low-power sensor networks to the most demanding tasks, such as voice encoding, music streaming and MP3 decoding."},{"name":"ESP32-WROVER","type":"Module","description":"ESP32-WROVER features both a 4 MB external SPI flash and a 8 MB external PSRAM, thus targeting a wide variety of applications."},{"name":"ESP32-WROVER-I","type":"Module","description":"ESP32-WROVER-I features an IPEX antenna. The module has both a 4 MB external SPI flash and a 8 MB external PSRAM, thus targeting a wide variety of applications."},{"name":"ESP-WROOM-02D","type":"Module","description":"ESP-WROOM-02D is an ESP8266EX-based module that have optimized RF performance."},{"name":"ESP-WROOM-02U","type":"Module","description":"ESP-WROOM-02U is an ESP8266EX-based module that has optimized RF performance. It integrates a U.FL connector."},{"name":"ESP-WROOM-02","type":"Module","description":"ESP-WROOM-02 is based on ESP8266EX, measuring as small a size as 18x20x3 mm."},{"name":"ESP-WROOM-S2","type":"Module","description":"ESP-WROOM-S2 can work as the SDIO/SPI slave, with the SPI speed being up to 8 Mbps. "},{"name":"ESP32-S2-DevKitM-1","type":"DevKit","description":"ESP32-S2-DevKitM-1 is an entry-level development board based ESP32-S2-MINI-1 or ESP32-MINI-1U. It has all the ESP32-S2 pins exposed and is easy to connect and use."},{"name":"ESP32-S2-Saola-1","type":"DevKit","description":"ESP32-S2 general-purpose development board, based on ESP32-S2-WROVER, ESP32-S2-WROVER-I, ESP32-S2-WROOM or ESP32-S2-WROOM-I, with 4 MB flash and pin header."},{"name":"ESP32-S2-Kaluga-1","type":"DevKit","description":"The new multimedia development board ESP32-S2-Kaluga-1 based on ESP32-S2 has various functions, such as an LCD screen display, touch panel control, camera image acquisition, audio playback, etc. It can be flexibly assembled and disassembled, thus fulfilling a variety of customized requirements."},{"name":"ESP32-DevKitC","type":"DevKit","description":"ESP32-DevKitC is an entry-level development board. It has all the ESP32 pins exposed and is easy to connect and use."},{"name":"ESP32-DevKitM-1","type":"DevKit","description":"ESP32-DevKitM-1 is a ESP32-MINI-1-based development board produced by Espressif. Most of the I/O pins are broken out to the pin headers on both sides for easy interfacing. Developers can either connect peripherals with jumper wires or mount ESP32-DevKitM-1 on a breadboard."},{"name":"ESP-WROVER-KIT-VE","type":"DevKit","description":"The ESP-WROVER-KIT-VE is a variant of ESP-WROVER-KIT that comes with an ESP32-WROVER-E module by default. This board features support for an LCD and MicroSD card. The I/O pins have been broken out from the ESP32-WROVER-E for easy extension. The board carries an advanced multi-protocol USB bridge (the FTDI FT2232HL), enabling developers to use JTAG directly to debug the ESP32 module through the USB interface. The development board makes secondary development easy and cost-effective."},{"name":"ESP32-PICO-KIT","type":"DevKit","description":"ESP32-PICO-KIT is Espressif's smallest development board, as it fits into a mini breadboard. It is fully functional with the minimum number of discrete components, while it has all the ESP32 pins exposed."},{"name":"ESP32-PICO-V3-ZERO-DevKit","type":"DevKit","description":"ESP32-PICO-V3-ZERO-DevKit is a development board based on ESP32-PICO-V3-ZERO (ACK) module. Its pin layout is compatible with that of Arduino Zero development board, therefore, this ESP32-PICO-V3-ZERO-DevKit can directly plug in Arduino Zero board, or connect with other host boards and peripherals via jumper. "},{"name":"ESP32-PICO-DevKitM-2","type":"DevKit","description":"ESP32-PICO-DevKitM-2 is a ESP32-PICO-MINI-02-based development board produced by Espressif. Most of the I/O pins are broken out to the pin headers on both sides for easy interfacing. Developers can either connect peripherals with jumper wires or mount ESP32-DevKitM-1 on a breadboard."},{"name":"ESP-EYE","type":"DevKit","description":"ESP-EYE is a development board for image recognition and audio processing, which can be used in various AIoT applications. It features an ESP32 chip, a 2-Megapixel camera and a microphone. ESP-EYE offers plenty of storage, with an 8 MB PSRAM and a 4 MB flash. It also supports image transmission via Wi-Fi and debugging through a Micro-USB port."},{"name":"ESP32-LyraT","type":"DevKit","description":"The ESP32-LyraT development board is designed for the speech and voice recognition market. It integrates the ESP32-WROVER-E module, which includes a dual-core processor and 4.5 MB of operating memory. With this development board, only few peripheral devices are required for implementing a highly-integrated audio solution."},{"name":"ESP32-LyraT-Mini","type":"DevKit","description":"ESP32-LyraT-Mini is a lightweight audio development board based on ESP32-WROVER-E, which implements AEC, AGC, NS WWE (wake word engine) and other audio signal processing technologies."},{"name":"ESP32-LyraTD-MSC","type":"DevKit","description":"ESP32-LyraTD-MSC, one of Espressif’s Audio Development Boards, is an Acoustic Echo Cancelation (AEC) solution supporting voice recognition, near-field and far-field voice wake-up. Audio files in the format of AAC, FLAC, OPUS and OGG can be decoded and output without quality loss. It also supports connection to Baidu's DuerOS and Amazon's Alexa Voice Service (AVS)."},{"name":"ESP32-LyraTD-SYNA","type":"DevKit","description":"ESP32-LyraTD-SYNA is one of Espressif’s Audio Development Board based on ESP32 MCU and Synaptics DSP. It is an Acoustic Echo Cancelation (AEC) solution, supporting voice recognition and voice wake-up. It also supports connection to Amazon’s AVS (Alexa Voice Service), Google's Dialogﬂow and Google's GVA (Google Voice Assistant)."},{"name":"ESP32-LyraTD-DSPG","type":"DevKit","description":"ESP32-LyraTD-DSPG  is based on ESP32-WROVER-B, a BT/Wi-Fi combo module, and a digital signal processor (DSP) that features a three-microphone array for noise reduction, echo cancellation, beamforming and wake-word detection. ESP32-LyraTD-DSPG is integrated with peripheral devices and consists of two development boards. The sub board mainly consists of the microphone array, function keys and LEDs. The main board is integrated with power management, Wi-Fi and audio modules like dsp, codec and power amplifier. The two boards can be connected with FPC."},{"name":"ESP32-Vaquita-DSPG","type":"DevKit","description":"ESP32-Vaquita-DSPG is Espressif’s new Alexa built-in solution powered by ESP32 and DSP Group’s DBMD5P audio SoC. With a 2-Mic array which allows for a 360-degree pick-up, the solution provides a superior far-field voice recognition performance. The new ESP32-Vaquita-DSPG development kit is a turnkey solution for easily creating Alexa built-in connected devices that provide out-of-the-box voice enablement and AWS-IoT cloud connectivity."},{"name":"ESP32-Korvo","type":"DevKit","description":"ESP32-Korvo is an ESP32-based audio development board with microphone array, together with Espressif's speech recognition SDK ESP-Skainet, ESP32-Korvo is suitable for far-field speech recognition applications with low power consumption. ESP32-Korvo is composed of two boards connected by an FPC cable: the main board contains ESP32-WROVER-E module, power port, micro SD card slot, earphone and speaker connectors; the sub board contains microphone array, function buttons and LEDs."},{"name":"ESP32-Korvo-DU1906","type":"DevKit","description":"ESP32-Korvo-DU1906 is an Espressif audio development board with an ESP32-DU1906 module as its core. This board is designed not only to provide advanced end-to-end audio solutions with highly efficient integrated AI capabilities as well as a Cloud + End integrated device-level AIoT platform, significantly lowering the barrier to entry for IoT devices to AI capability."},{"name":"ESP32-LCDKit","type":"DevKit","description":"ESP32-LCD-Kit is an HMI (Human Machine Interface) development board based on ESP32-DevKitC (need to purchase if you didn’t have one). ESP32-LCDKit is integrated with such peripherals as SD-Card, DAC-Audio, and can be connected an external display. The board is mainly used for HMI-related development and evaluation.Development board reserved screen interface type: SPI serial interface, 8-bit parallel interface, 16-bit parallel interface."},{"name":"ESP-Launcher","type":"DevKit","description":"ESP-Launcher is a Micro USB-powered development board that allows access to all 32 pins of ESP8266. It integrates the commonly-used peripherals."},{"name":"ESP8266-DevKitC","type":"DevKit","description":"ESP8266-DevKitC is an Espressif compact development board based on ESP8266 modules. All of the I/O pins of the module are broken out to the female header connectors on both sides of the board for easy interfacing. Developers can connect these pins to peripherals as needed. "},{"name":"ESP32-Sense Kit","type":"DevKit","description":"The ESP32 touch sensor development kit, ESP32-Sense Kit, is used for evaluating and developing ESP32 touch sensor system. ESP32-Sense Kit consists of one motherboard and multiple daughterboards. The motherboard contains a display unit, a main control unit and a debug unit. The daughterboards have touch electrodes in different combinations or shapes, such as linear slider, wheel slider, matrix buttons and spring buttons, depending on the application scenarios."},{"name":"ESP-Prog","type":"DevKit","description":"ESP-Prog is one of Espressif’s development and debugging tools, with functions including automatic firmware downloading, serial communication, and JTAG online debugging. ESP-Prog's automatic firmware downloading and serial communication functions are supported on both the ESP8266 and ESP32 platforms, while the JTAG online debugging is supported only on the ESP32 platform. ESP-Prog uses FT2232HL as its USB Bridge Controller chip."},{"name":"ESP32-MeshKit-Sense","type":"DevKit","description":"ESP32-MeshKit-Sense is a development board with an ESP32 module at its core. It features peripherals, such as a temperature and humidity sensor, an ambient light sensor, etc. The board can be interfaced with screens. The board is mainly used to detect the current consumption of ESP32 modules in a normal operation state or in sleep mode, when connected to different peripherals. "},{"name":"ESP32-D0WDQ6","type":"Soc's","description":""},{"name":"ESP32-S0WD","type":"Soc's","description":""},{"name":"ESP8285","type":"Soc's","description":""},{"name":"ESP32-C3","type":"Soc's","description":""},{"name":"wd","type":"DevKit","description":"ecwec"},{"name":"mn ","type":"Soc's","description":"kj "},{"name":"ESP32-C3F","type":"Soc's","description":""},{"name":"ESP32-D2WD","type":"Soc's","description":""},{"name":"ESP32-Ethernet-Kit","type":"DevKit","description":"ESP32-Ethernet-Kit is an ESP32-based development board produced by Espressif. It consists of two development boards, the Ethernet board A and the PoE board B, The Ethernet board contains Bluetooth / Wi-Fi dual-mode ESP32-WROVER-E module and IP101GRI, a Single Port 10/100 Fast Ethernet Transceiver (PHY). The PoE board (B)  provides power over Ethernet functionality. The A board can work independently, without the board B installed. Key Features: 10/100 Fast Ethernet with RJ45 interface, PoE power, Wi-Fi 802.11b/g/n, JTAG debug"},{"name":"ESP32-C3-DevKitM-1","type":"DevKit","description":"ESP32-C3-DevKitM-1 is an entry-level development board equipped with ESP32-C3-MINI-1. Most of the I/O pins are broken out to the pin headers on both sides for easy interfacing. Developers can either connect peripherals with jumper wires or mount ESP32-C3-DevKitM-1 on a breadboard."}]